---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
source: html/fd4a91e6-2ecd-0bc5-2bb2-c868723bf914.htm
---
# AnalysisDisplayStyle Properties

The id of the assembly instance to which the element belongs.